{
  "title": "Spiced Fish with Rice & Beans and Tomato Salsa",
  "ingredients": [
    "2 tablespoon ground Aleppo pepper",
    "1 tablespoon salt",
    "2 teaspoon ground coriander",
    "2 teaspoon smoked paprika",
    "1 teaspoon ground cumin",
    "2 teaspoon garlic powder",
    "4 tablespoons butter, softened",
    "4, 6-ounce salmon fillets, skin off",
    "2 tablespoons olive oil",
    "1 lime",    
    "8 ounces red or black beans",
    "4 tablespoons olive oil",
    "1 small onion, medium dice",
    "1 stalk celery, diced",
    "2 tablespoons minced garlic",
    "1 tablespoon finely chopped fresh ginger",
    "3 sprigs thyme",
    "1 bay leaf",
    "2 quarts chicken broth",
    "1 14-oz can coconut milk",
    "2 1/4 cup long grain rice",
    "1 zucchini, diced ",
    "½ cups corn kernels",
    "1 cup kale, torn into large pieces",
    "Spring Vegetable Salsa",
    " 1 pint cherry tomatoes, cut in half",
    "½ red onion, diced",
    "1 avocado, diced",
    "4 radishes, thinly sliced",
    "1 jalapeño, seeds removed and diced",
    "1 Persian cucumber, diced",
    "1 garlic clove, finely minced",
    "½ cup chopped cilantro",
    "1 lime, juiced",
    "Salt & pepper to taste"       
    
  ],
  "prepTime": 60,
  "steps": [
    "Spice Roasted Fish Combine the pepper, salt, coriander, paprika, cumin and garlic powder in a small bowl and set aside."
    "Combine half of the spice mixture in a small bowl with the softened butter and mash together until smooth." 
    "Brush the butter mixture on both sides of the fish and set aside.Place a large skillet over medium heat,"
    "add the olive oil and once the oil shimmers, add the fish and cook for 5 minutes. Turn fish over and continue to cook for 3 minutes"
    "while continually basting with butter. Remove from the heat and finish with a few squeezes of the lime."
    "Place the oil in a large Dutch oven, set over medium high heat and when the oil shimmers, add the onion and celery."
    "Cook, stirring frequently, until the onions are translucent, 4 to 5 minutes."
    "Rice & Beans: Place 2 tbsp of olive oil in a large Dutch oven, set over medium high hear and when the oil shimmers,"
    "add the onion and celery. Cook stirring frequently, until the onions are translucent, 4 to 5 minutes.Add the garlic, ginger,"
    "and spice mixture and continue cooking 1 to 2 minutes.Add the thyme, bay leaf, beans, broth and coconut milk."
    "Stir to combine and bring to a simmer. Decrease heat to maintain a simmer, cover and cook until beans are just tender,"
    "1 ½ to 2 hours.Add the rice and stir to combine. If necessary, increase the heat to bring to a simmer. Decrease the heat"
    "to maintain a simmer, cover and cook until the rice is tender, about 25 minutes.Taste and adjust the seasoning as desired."
    "Spring Vegetable Salsa: Combine all ingredients in a bowl. Let sit at room temperature for 30 minutes. If not serving immediately, refrigerate for up to 2 days."
  ],
  "author": "Berhane",
  "countryOfOrigin": "Ethiopia",
  "course": "Main"
}
